using System;
using System.Windows.Forms;
using библиотекаИсполнителяПутник;

namespace исполнительПутник_v_2
{
    public class решениеЗадачи
    {

        Путник путник;
        гаммаЦветов цветЗакраски = гаммаЦветов.красный;
        
        public решениеЗадачи()
        {
            // Инициализация сгенерированной обстановки
            путник = new Путник("Inlet.in");
            try
            {
                путник.повернутьсяНаправо();
                путник.повернутьсяНаправо();
                
                путник.сделатьШаг();
                путник.повернутьсяНалево();
                if (путник.впередиСвободно)
                    while (путник.впередиСвободно)
                    {
                        путник.сделатьШаг();
                        путник.закрасить(гаммаЦветов.голубой);
                    }
                
                путник.повернутьсяНаправо();
                путник.повернутьсяНаправо();
                
                while (путник.клеткаЗакрашена)
                {
                    путник.сделатьШаг();
                }
                
                путник.сделатьШаг();
                путник.повернутьсяНаправо();
                
                
                путник.работаЗавершена();             
            }
            catch (Exception сообщение)
            {
                //***********************************************************************************
                // Замечание:  Сообщения выводятся только при условии указания темы и номера задачи *
                //***********************************************************************************
                MessageBox.Show(сообщение.Message, "Причина ошибки");
                MessageBox.Show(путник.ToString(), "Место Путника в период ошибки");
            }
        }
               
    }
}
